Revit 2027 API
RebarShapeDrivenAccessor.SetLayoutAsNumberWithSpacing Method
 Sets the Layout Rule property of rebar set to NumberWithSpacing
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLayoutAsNumberWithSpacing(
	int numberOfBarPositions,
	double spacing,
	bool barsOnNormalSide,
	bool includeFirstBar,
	bool includeLastBar
)
Public Sub SetLayoutAsNumberWithSpacing (
	numberOfBarPositions As Integer,
	spacing As Double,
	barsOnNormalSide As Boolean,
	includeFirstBar As Boolean,
	includeLastBar As Boolean
)
public:
void SetLayoutAsNumberWithSpacing(
	int numberOfBarPositions,
	double spacing,
	bool barsOnNormalSide,
	bool includeFirstBar,
	bool includeLastBar
)
member SetLayoutAsNumberWithSpacing :
        numberOfBarPositions : int *
        spacing : float *
        barsOnNormalSide : bool *
        includeFirstBar : bool *
        includeLastBar : bool -> unit
Parameters
numberOfBarPositions Int32
 The number of bar positions in rebar set
spacing Double
 The maximum spacing between rebar in rebar set
barsOnNormalSide Boolean
 Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal
includeFirstBar Boolean
 Identifies if the first bar in rebar set is shown
includeLastBar Boolean
 Identifies if the last bar in rebar set is shown
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  the number of bar positions numberOfBarPositions is less than 1 or more than 1002. -or- The spacing isn't bigger than 0.0.
InapplicableDataException |  This RebarShapeDrivenAccessor is an instance of a spiral or multiplanar shape.
InvalidOperationException |  This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
Remarks
 When changing the layout rule to NumberWithSpacing, you must also simultaneously set NumberOfBarPositions, Spacing, BarsOnNormalSide, IncludeFirstBar, and IncludeLastBar properties.
See Also
Reference
RebarShapeDrivenAccessor Class
Autodesk.Revit.DB.Structure Namespace